{"title":"Placement Fundae - Aditya Rajawat","date":"23rd October 2020","intro":"Hello, I am Aditya Pratap Singh Rajawat, a recent BT-MT dual-degree graduate from the Department of Mechanical Engineering. I have joined Jaguar Land Rover India as a Graduate Mechanical Engineering Trainee.\r\nI understand these are challenging times for you all, but leverage on the opportunities you have. Remember, companies don't seek experts, but students that could be made experts. Be confident and know your worth\r\n","content":"<p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\"><strong>PERSONAL BACKGROUND<\/strong><\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">Throughout these five years on campus, I have always found something exciting and equally challenging to keep myself hooked to work. It all started with me joining SAE club during my freshman year in the Chassis subsystem. It was more of a decision based on my branch and exploring core opportunities. As my involvement in the club increased, I enjoyed working and gained interest in the design and simulation of mechanical systems. This helped me to choose my second-year internship in the Experimental stress analysis lab through the SURGE programme, working on high impact testing and simulation of glass fibre laminates.&nbsp;<\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">I was not limiting myself to experiences in core-fields and explored competitive programming, web development, and computer security during my freshman and sophomore years. The primary purpose of the explorations was to try and learn new things while finding what interests me more. During the times when things didn’t go as per the plan, I was getting sure of things that I didn't want to do in my life as I was just busy striking out the things in the long list of items that didn’t inspire me.<\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\"><strong>INTERNSHIP EXPERIENCE<\/strong><\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">SAE was the only constant, where I started taking more responsibilities and learning more about automotive systems. It was more of startup experience, working towards building a product as well as a team of like-minded people. Moving ahead in my journey, for the third year internships, my focus was more towards the core mechanical companies as well as foreign research opportunities. Even after facing multiple rejections in the first leg of the internship season itself, neither did I lose hope nor did I compromise even for a split second to succumb to the rat race going out there. Due to my perseverance, finally, I bagged two options for my summer internship. First, an internship in an automotive-solutions industry and during the same time, the results of research internships were out, and I was selected for the TAMU exchange program to work in the Unmanned systems lab. I went for the latter, the research internship, looking forward to learning more from international exposure. It was nothing less than ideal experience, getting an opportunity to work on system identification and control design for an autonomous truck. The work experience helped me to narrow down my research interests towards dynamic modelling and control systems. More than that, it exposed me to the world out there, the possibilities, their scope and helped me start growing my lifelong network of some really awesome individuals.<\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\"><strong>OPTING FOR DUAL DEGREE<\/strong><\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">Returning to campus from internship, I opted for dual-degree, the decision was mostly based on the ongoing long-term research project for building an AWD Electric vehicle. The goal was to gain in-depth knowledge in the field of interest and more clarity towards future plans. During my master’s thesis, I worked on optimization-based planning and control of legged robots. The experience was more of a test of my slogging capabilities, building perseverance, and following my self-set goals with complete ownership. In retrospect, this phase of my life brought me face-to-face with the world of academia, adding to an enriching experience.&nbsp;<\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\"><strong>PLACEMENT PREPARATION<\/strong><\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">In the placement season, I was looking for an R&amp;D role in the core mechatronics industry. I was clear about what I wanted to work on, but also knew that I won’t be getting many options to choose from. There were only a few companies that offered similar roles, and I had to prepare and look for other options too, to be on the safe side. I prepared for both mechanical core and IT-based non-core roles, getting involved with friends who were preparing for coding tests. For non-core tests, I worked on multiple algorithms through examples and practice questions, mostly through GeeksforGeeks, which helped to gain a good hand as I hadn’t done Data Structures before.<\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">For core tests, I brushed through the GATE handbook, along with practising general aptitude tests. I realised the importance of practice a bit late when I experienced the difference in carefully attempting an alien question with curiosity over the speedy knowing-it-all question that felt trivial after a good practice. The faster you reach the phase where you encounter lesser new questions at each test, the better you position yourself in the race.&nbsp;<\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">The most crucial factor of core placements in my opinion is your resume. Every word in your resume can fuel a discussion during your interview, so make sure you choose your words wisely and prepare it thorough enough. I had made a couple of resumes, separately for different roles offered by core companies and a few for non-core ones as well. In core resumes, the focus was on the department projects, SAE and internships, knowing beforehand the target company requirements. The list of core mechanical companies in my radar was JLR, Eaton, Bajaj, GE, Mahindra, Caterpillar, along with some tech-startups namely AgniKul Cosmos and Invento Robotics. In non-core resumes, I included inter-disciplinary projects, course projects done in elective courses, the positions held and the extra-curricular activities.<\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">For JLR, I was required to have both a resume and a Statement of Purpose. The job description was quite comprehensive, with well-framed points of what is expected from a suitable candidate. It helped me to decide the major highlights in my SOP and identify the ways to portray my qualifications and experience as per their requirements. I was clear of this being my best shot based on the congruence of their requirements and my experiences and interests. What was required of me was to prepare for a confident pitch.<\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\"><strong>TEST AND INTERVIEW PROCESS<\/strong><\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">Attending the pre-placement presentation of JLR, I was clear to target this company and give my best. The presentation provided an impression of a startup culture embedded with a big brand name, which was enough to get my eyes locked. I applied for both the mechanical and software profiles. The placement test included three sections - aptitude, mechanical, and coding,&nbsp; the coding section being available for all the job profiles. The questions in the aptitude and mechanical sections were of similar levels to that of core internship tests. In the coding section, there were two questions; the first one was on identifying a leap year and the second one on dynamic programming. The questions were slightly towards lower difficulty, compared to other software companies.<\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">Based on the test, I was shortlisted for the interview in the mechanical profile on Day 1. This was the only interview for me on Day 1, that too, in the afternoon slot. Even before entering the interview room, the interviewers had a fair idea about me through my resume and SOP, and that always sets the first impression. In the interview, after a brief introduction, my focus was to bring the discussion towards projects related to vehicle control while also highlighting my contribution to the SAE team. I started nervously, but after striking good discussions, the interview was mostly around my resume. However, it never got into the work I did as a part of the SAE team, which I tried hard to, and revolved around projects in control theory and internship. I was asked about optimal control formulation, lyapunov stability and few questions on kalman filters. Once easing me into the interview, the interviewers tried to hit different chords to disturb the equilibrium, by getting into the nitty-gritties of theoretical concepts in control and optimization. I was transparent enough to give them an idea of what I don’t know in depth, while taking them through the approach if I divide or relate the question into simpler known problems. The interview went around for less than half an hour, as opposed to others, where it was extending close to an hour. After giving the interview, I waited until the end of the day for the results. It all ended when my friend came rushing by, cutting the crowd around the notice board, to hug me.<\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\"><strong>PIECE OF ADVICE<\/strong><\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">Keep in mind you’ll never be this young again. Take your chances and do what excites you. Don’t generalize the methodologies used by others to chase your targets, rather carve your own path. Stick with your friends and sail through.&nbsp;<\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">All the best for your placements.<\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">Love the Doing!<\/span><\/p>","author":"Aditya Pratap Singh Rajawat"}