{"title":"Placement Fundae - Arpit Agarwal","date":"2nd October 2020","intro":"Hey Everyone, I am Arpit Agarwal, a Y16 graduate with B.Tech. in Chemical Engineering and placed at Goldman Sachs. I know most of you are in great stress because of the placement season coming around which is amplified by these unprecedented times of COVID. I am here to share my experiences from the placement season with the hope that it might help you with yours. ","content":"<p><span style=\"background-color:transparent;color:#000000;\"><strong>Searching for my Interest<\/strong><\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">I started my journey at IITK with a huge interest in core chemical engineering and dreamt of getting placed into some good FMCG companies like HUL and ITC. To make my path I started researching with one professor from my department and then securing an Intern at Tata Steel, Jamshedpur for my second-year summers. My experience at Tata Steel and some interviews during the internship season for FMCG companies made me realize that core is not for me. At that time, I was also doing data structures &amp; algorithms course and was enjoying the coding assignments a lot. But this was not enough to get me an internship in non-core as I had no background or projects to get into software, quant, or data science companies. I decided to use my third-year summer to build upon my skills and change my background. I knew research internships were not that hectic compared to corporate and with my background in research, I could easily get a research internship abroad. I went to the University of Waterloo, Canada, and worked on predicting diseases from retinal images using deep learning. The first half of the project was similar to my previous work at TATA steel and could finish it in a week. The second part involved deep learning and for the most part of the intern, I utilized learning deep learning and doing lots of coding every day. This internship was the turning point as it changed my background, provided me with the skills I needed and I got to publish two conference papers.&nbsp;<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\"><strong>Before Placement Season<\/strong><\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">After coming back, I knew I was going to sit for placements but was worried a bit because my resume was flooded with research projects and two papers which made me look like a person who would leave the job after a year and go for Masters. I talked to many seniors and after taking a look at my resume they said I could get a job in software, quant, data science roles as well as in consulting. I was in a great dilemma of choosing what to prepare for and could never narrow down to one. I prepared for software, quant, data science, and even for consulting roles. I was more inclined towards quant and data science roles but was not sure whether the companies would even shortlist me even after good test scores. It was only 5 or 6 days before the Interviews that I came to know that I have been shortlisted in companies like Goldman Sachs, Salesforce, SAP Labs, etc. That’s when I was sure that I didn’t want to go for consulting and Goldman Sachs became my major target. I guess in my case I was good at managing time and prepared for all those things while managing academics, but I will seriously advise to narrow down on your interests. This way the whole process would become less stressful and you’ll have time to prepare for specific companies.&nbsp;<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\"><strong>Preparation Time<\/strong><\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">The placement process starts as soon as the semester kicks in. The resume submission deadline was around 1 month after coming to campus. I built my resume upon the existing resume from the intern season. I had my internship resume reviewed by around 10 seniors and was sure there is nothing to be changed there. I made two resumes first for Software, Quant, and Data science roles, and second for Consulting. Got them reviewed from relevant seniors and friends and was good to go. During the first 5-6 days, I talked to many seniors and developed insights on how to prepare for different companies and made a list of companies I’d be targeting. After all the advice I knew I had to start competitive coding, prepare OOPs, and solve problems from Brain stellar and 50 Challenging problems in probability. Unlike many, I was starting competitive coding very late, and trust me that is not an issue and 4 months of preparation is enough to get in a good company. For competitive coding, theoretical part is Data Structures &amp; Algorithms and I already had a good hold on that. For practicing, I solved most of the questions from Interview bit. I actively solved questions from previous years which is available on a google doc whose link can be found at Facebook group “Inter IIT\/NIT\/IIIT\/BITS placement 2020”. Geeks for Geeks was helpful as it has a detailed explanation of many questions. For quantitative questions, I solved questions from brain stellar and fifty challenging problems in probability every day. Goldman’s test was in early October so I finished my preparation before it. The test consisted of two sections. The first section consisted of 3 coding problems and some MCQs. The problems were of moderate difficulty. For example, they asked the Knapsack problem which can be easily solved by Dynamic Programming. MCQs were on DS&amp;A and OOPs mostly. The second section consisted of Quant questions that revolved mainly around Probability and Expectation problems. Some math questions were also there.&nbsp;<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">Usually, there were 1-2 or two tests every day which increased to 5-6 during weekends. I gave around 50-60 tests and attended a similar number of PPTs. Results started to come one week before the interviews which kicked off on 1st December. I prepared for the interview very late and had just 2 or 3 days. For the most part, I prepared how to introduce myself and solved interview questions from geek for geeks regarding specific companies.<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\"><strong>Final Step: Interviews<\/strong><\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">I knew I will have at least some interviews on the first day and would have no mock interview preparation. So, I applied for ITC with no intention of getting placed but to get interview practice. I also had an interview with PWC which is a consulting firm because I had no clarity initially when the application came. On the first day, I had interviews with Goldman Sachs, ITC, and PWC in slot 1 and Salesforce and SAP Labs in slot 2. Interviews started at 5:00 AM and I didn’t have any sleep the last night. I had one round with ITC which helped me practice for Goldman Sachs. For PWC I refused to give an interview. With Goldman, I had three rounds each having some share of DS&amp;A and puzzles. Very first question was to calculate the expected no of moves that ant has to take to move from one vertex to the diagonally opposite vertex on the cube given the same probability to traverse to each adjacent vertex. One question was on the Monte Carlo simulation and I had to write working code on paper. I chose C++ but there was no bound-on language. I had a chance to introduce myself in each round and ask questions from the interviewer in the end. I would suggest having a good introduction prepared and answer all the questions which you think the interviewer might ask in the introduction part itself. I made them understand why I did research and why I am sitting for placements and had no intension to go for further studies in the introduction itself. Secondly, while solving questions during the interview make sure to make sure the interviewer is following you. This way if you make any mistake, he will try to divert your attention to that, and secondly, it helps them understand your thought process. I was selected in Goldman Sachs and my placement process ended there.&nbsp;<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\"><strong>Some Advice<\/strong><\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">My interview process was very smooth but it can get pretty rough very quickly. I have seen people getting rejected and then losing hope. The placement season is for sure going to test your patience level. I will advise you to be as confident as you can be, try to keep your friends around and don’t try to isolate yourself. Friends are the only support system you have during this process and many of you will develop a serious bond with your friends because of this process. Lastly, don’t forget to help your friends once you are placed.&nbsp;<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">Thank you for your time and good luck with your future endeavors. Cheers!!<\/span><\/p>","author":"Arpit Agarwal"}