{"title":"Placement Fundae - Prajual Maheshwari","date":"18th Novemeber 2020","intro":"Prajual is a Y16 economics graduate who is currently placed at Amreican Express as a Management Trainee.","content":"<p><span style=\"background-color:transparent;color:#000000;\"><strong><u>Time to make a decision: Introduction<\/u><\/strong><\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">This blog can be a dream breaker, which might reveal some bitter truths about the IITK placements, so read further at your own discretion. Let me give a few more pointers to you in order to help you decide whether this is for you or not. Starting with a brief intro of mine, I am Prajual Maheshwari, Y16 BS Economics (yes! graduated class of 2020). My CPI was a bit on the higher side (so, I will not reveal it, so that nobody gets obsessed). I did a modest number of internships and projects when I was on campus. I was placed at American Express or AmEx, with a weird profile name of Management Trainee (albeit the job is related to Data Analytics and Machine Learning only). On the professional front, my interests overarch’s the field of Data Analytics, Finance and sort of Management consulting but my job lies at a juncture of ML, data analytics, and Finance (not much though). Also I am not a pure software person and just one more caveat before proceeding further, this article is going to be a bit longer. If all this resonates with your dream job and create a spark in you, then let’s move ahead.<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\"><strong><u>Discerning my Interests&nbsp;<\/u><\/strong><\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">As a convention, analytics is something which interests a lot of IITians, everyone loves to solve critical problems and so was me. If you interact with a bunch of people on campus, it is almost inevitable to meet someone who works in the field of ML, something similar happened to me. My “Baapu” is a big ML player and initially I got interested in this field through him only. Anon I realised that ML and data are the two things that have got enough problems to satisfy my voracious hunger for analytics. I don’t think there is an explicit need of elaborating what constitutes ML and data analytics. Finance is one other domain which created a spark (I apply ML and data to this domain) and I continue reading about it as a hobby. In my opinion it is a life skill (although I still don’t completely know what I want to do, I am exploring and it will take time).<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\"><strong><u>Future as reflection of past: Past Experience<\/u><\/strong><\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">As per a popular adage, “Everything happening to you is the result of some past karma”. This stands apt to my current career trajectory so far. It all started with my 3rd semester, a typical UG with a desire to build a profile tried exploring his department and ended up getting a&nbsp; mathematical and theoretical project in Economics and soon realized that it is not my cup of tea. Owing to my department, a predisposition emerged towards finance, which on exploring felt nice and I did some online courses to gain some traction. During my 2nd year summers, I did two things, NYU RTE and SURGE in economics. Surge project was more of a play with data but no ML was involved in it, on the other hand NYU RTE project was based on machine learning and data combined. Both of them had no finance in them at all. With this as my prior experience on my resume, I secured an Internship from SPO at Fidelity Investments, Chennai (this company came much earlier during my year and was open for all, as compared to Y17s case). To make my profile a bit more versatile I did a startup intern during the winter break and worked on Natural Language Processing (NLP) on some social media analyzer.&nbsp; Again during my intern at Fidelity, I worked on a resume scanner using NLP. So, a proclivity towards the field of ML and data Analysis was established because of my experience and towards finance because of my personal interest which led me to a final placement offer at AmEx.<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\"><strong><u>Call on Placement Drive<\/u><\/strong><\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">As I moved into the first few weeks of my internship I realized that my top priorities of having a steep learning curve and a decent CTC will not be satisfied by this company. Hence I was certain that I will not accept the PPO even if they offer it to me. Moreover, the Chennai city and it’s water crisis strengthened my aforementioned decision. An added advantage to this early decision was I got a bit more time to prepare than my fellow mates and hence I started my prep there in Chennai itself. Getting out of that inertia and starting to prepare all over again, can be a bit of a challenge. So I started with something which was fun but equally important i.e. talking to seniors on these few pointers.<\/span><\/p><ol><li><span style=\"background-color:transparent;color:#000000;\">Whether the placement season will be any different from the Internship season. The brief and precise answer is that it depends on the factor you consider. For example:<\/span><\/li><li><span style=\"background-color:transparent;color:#000000;\">During the placement drive, absolute number of companies open for all are much more as compared to internship (and hence placement drive is much more hectic) but the proportion of companies open for CSE, MTH and EE versus open for all doesn’t change significantly (although a number of companies do change there criteria’s during walk-in rounds during placement time).&nbsp;<\/span><\/li><li><span style=\"background-color:transparent;color:#000000;\">A bit more variety of profile like product management, consultant, etc. come for placements which don’t come during internships. So this can be another added advantage.<\/span><\/li><\/ol><p><span style=\"background-color:transparent;color:#000000;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;2. &nbsp; Companies and profiles I should focus on i.e. for those I will be the best fit.<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">So, once the broad picture of placement became clear, I shortlisted a set of companies as my primary focus and kick-started my preparation in a multi-tasker manner like during the weekends, I devoted some time to coding, some time to pariksha tests and puzzles, and some time for updating my resume (obviously weeks were busy going to office n all). By the end of the internship my resume was updated and reviewed by a lot of seniors. Thanks to Aditya Bajpai, Agrim Bari, Ayush Agarwal, Ayush Anurag, Bhuvan Beejawat, Mugdha Arora, Pratyush Rai, Pritesh Kumbhare, Riya talati and many more (I apologize for missing them) for helping me out.<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">The 7th semester started in a pretty much routine tone apart from the apprehensions within me and shortly to everyone’s surprise consulting firms arrived for placement (a bit earlier than the usual), but let me not get into the details and cut it short and reveal to you the sad demise of my consulting target. I was not shortlisted for Mckinsey and Bain and in BCG I was not able to make it to the final interviews. My seniors convinced me that this happens and finally life will reach a better point. As pointed out by them, case prep helped me during the placement drive finally.<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\"><strong><u>Placement Preparation at a Glimpse<\/u><\/strong><\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">The semester progressed and nothing significantly unusual happened till the mid-sem break. Till then I continued my preparation from different resources I gathered from talking to different seniors and peeps.&nbsp; As new seniors from different firms were contacted, each one of them told about some new resources and eventually the preparation progressed. The preparation for placement included a few more things than the internships which include case solving and guesstimates. Even if you are not a consulting person, cases will help structure your thoughts and most companies do ask them in the interviews although not as intensively as consulting firms do. The preparation for product management roles require different sorts of cases like the ones given in Cracking the PM Interview, Decode and Conquer, etc. Product manager roles are growing enormously in numbers and popularity, some companies are Flipkart, Meesho, Mastercard etc. The preparation is absolutely different from the mainstream data analysis and ML roles. Some firms like American Express require ML, data analysis and case solving as well in your skills bucket to get through.&nbsp;<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">The placement tests arrived and the whole atmosphere assumed an air of seriousness. Placement tests were similar to those during internship season, most of them had coding, aptitude, probability questions, and some had theoretical ML questions as well. As you will see in the interview questions description, companies&nbsp; don’t require you to be a ML pundit, just a few projects and internship experience in the field will be enough. You will still have to prepare for coding, puzzles, prob and stats with basic ML (All the resources are at the end). Different timeline of tests for companies across IITs creates an arbitrage opportunity often exploited during placement season using a Facebook group (everyone gets it as and when the time arrives) and friends from other IITs who help each other informing some test questions beforehand abating some trouble from life.<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">It is highly unlikely that you haven’t seen this doc but in case you haven’t and for the sense of completeness you can take a look at this. It might be of some help for you. This document contains all the resources I used for placement preparation.<\/span><\/p><p><a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https:\/\/docs.google.com\/document\/d\/1az8Ky3LlqaRcRz0ZOE-tAC0KfCHEkfZk5aRzASZmadw\/edit?usp=sharing\"><span style=\"background-color:transparent;color:#1155cc;\"><u>https:\/\/docs.google.com\/document\/d\/1az8Ky3LlqaRcRz0ZOE-tAC0KfCHEkfZk5aRzASZmadw\/edit?usp=sharing<\/u><\/span><\/a><\/p><p><span style=\"background-color:transparent;color:#000000;\">This was my interngyaan video, may be of some help to you:<\/span><\/p><p><a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https:\/\/youtu.be\/RiBKzSUge1I\"><span style=\"background-color:transparent;color:#1155cc;\"><u>https:\/\/youtu.be\/RiBKzSUge1I<\/u><\/span><\/a><\/p><p><span style=\"background-color:transparent;color:#000000;\"><strong><u>The Decision Day: 1st December<\/u><\/strong><\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">Finally, the D-day arrived, I had 3 interviews scheduled on Day 1. The 1st one was in JP Morgan, quant role at 5:00 AM in the morning, got a call from an SPO volunteer (and as I walked out I could see a hell lot of cars outside hall 13, it felt like the day has come, to either make it or break it). I reached the venue, I sailed till the last round but didn’t make it (I don’t know why). Moreover, the PwC interviews were going alongside and finally there also after 3 rounds I didn’t got the offer(because they only selected those who didn’t have any other interviews on day 1.1). Then in slot 2, I had an interview in Indus insights but after the 1st round I said no to them and moved out of the interview room, and also from hall 13 as I was in a retrospecting mode and planning to prepare for my other interviews scheduled for day 2. I was disappointed (obvious), mostly because of JP Morgan. I was telling this whole day’s shit journey to one of my friend, and then I got a call from one of the SPO volunteers for an interview at AmEx (they didn’t shortlist me earlier, but extended the list to accrue some boys). So, I was finally able to make this interview into an offer and ended up getting placed at day 1.<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">Things like these or even worse happened with a lot of my mates but at the end of the day “sab sahi ho jaata hai”. This was once in a lifetime event, after day 1 I used to go to hall 13, for my friends till day 10, and believe me it feels great being there. All the details of questions asked in these interviews can be found in the doc as well.<\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\"><strong><u>Interview @JP Morgan -&nbsp; Quant Role (1st December (Slot 1.1))<\/u><\/strong><\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">&nbsp;&nbsp;&nbsp;&nbsp; They Shortlisted around 22 people based on the test.&nbsp;<\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">&nbsp;&nbsp;&nbsp; <strong>Test Details : <\/strong>2 Section of half - half hour&nbsp;<\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">&nbsp;&nbsp;&nbsp; 1st section had 3 sub-section<\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">&nbsp;&nbsp;&nbsp; 1.1&nbsp; Quant and puzzles (From books mentioned above)&nbsp;<\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">&nbsp;&nbsp;&nbsp; 1.2 Based on Maths and Complex Number<\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">&nbsp;&nbsp;&nbsp; 1.3 English based<\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">&nbsp;&nbsp;&nbsp; 2nd Section had 2 coding questions based dynamic Programming<\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">&nbsp;<\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">&nbsp;&nbsp;&nbsp; <strong>interview Details<\/strong> : They took 5 rounds<\/span><\/p><ol><li><span style=\"background-color:transparent;color:#000000;\">First round : Question on C++, Sql and Puzzles and&nbsp; Quant questions<\/span><\/li><li><span style=\"background-color:transparent;color:#000000;\">Second round : Assumption of Linear regression, Black - scholes model, Puzzles and Quant Question<\/span><\/li><li><span style=\"background-color:transparent;color:#000000;\">Third round : Basic Coding Question, Puzzles and Quant Questions<\/span><\/li><li><span style=\"background-color:transparent;color:#000000;\">Fourth round :&nbsp; Puzzles and Quant Questions and some simple coding question<\/span><\/li><li><span style=\"background-color:transparent;color:#000000;\">Fifth round : HR round, typical HR questions like why do you want to work for JPMC, why you took economics at IIT etc.<\/span><\/li><\/ol><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\"><strong><u>Interview @PwC DIAC (1st December (Slot 1.1))<\/u><\/strong><\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\"><strong><u>&nbsp;&nbsp;&nbsp; <\/u><\/strong>They shortlisted 30 people based on resume and gave a dinner treat at Landmark.<\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">&nbsp;&nbsp;&nbsp; <strong>Interview details : <\/strong>They took 2 rounds<\/span><\/p><ol><li><span style=\"background-color:transparent;color:#000000;\">First round : Simple Case study with guesstimate involved along with basic HR questions like your weakness etc.. This was an elimination round<\/span><\/li><li><span style=\"background-color:transparent;color:#000000;\">Second round : Again a Market entry case study followed by a few questions based on Resume.<\/span><\/li><\/ol><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\"><strong><u>Interview @Indus insights (1st December (Slot 1.2))<\/u><\/strong><\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">&nbsp;&nbsp;&nbsp; They shortlisted 80 people based on a simple written test&nbsp;<\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\"><strong>Test Details : <\/strong>It had 3 sections.<\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">Section 1&nbsp; Basic Aptitude and Data interpretation<\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">Section 2 Guesstimate<\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">Section 3 Subjective question like who is your role model.<\/span><\/p><p style=\"margin-left:36pt;text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">&nbsp;<strong>Interview Details : <\/strong>They officially had 3 rounds but I said “No” to them after the first round, because I didn’t want to work for this company and I knew I will get better opportunities in the future.<\/span><\/p><ol><li><span style=\"background-color:transparent;color:#000000;\">First Round : Simple Guesstimate on Revenue generated by Ola cabs on Delhi airport in a&nbsp; day.<\/span><\/li><\/ol><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\"><strong><u>Interview @American Express (1st December (Slot 1.2))<\/u><\/strong><\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">&nbsp;&nbsp;&nbsp;<\/span><\/p><p style=\"margin-left:36pt;text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">I was not shortlisted initially for this company because they just shortlisted girls and 3 boys (which they didn’t found suitable) so they further extended&nbsp; the boys shortlist and I was there.<\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">&nbsp;&nbsp;&nbsp;<\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\"><strong>Test Details : <\/strong>It had 3 sections.<\/span><\/p><ol><li><span style=\"background-color:transparent;color:#000000;\">Basic Aptitude<\/span><\/li><li><span style=\"background-color:transparent;color:#000000;\">Case Study (Unique Component of their test)<\/span><\/li><li><span style=\"background-color:transparent;color:#000000;\">Behavioral Questions<\/span><\/li><\/ol><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">&nbsp;&nbsp;&nbsp;<\/span><\/p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;color:#000000;\">&nbsp;<strong>Interview Details : <\/strong>They took 2 rounds:<\/span><\/p><ol><li><span style=\"background-color:transparent;color:#000000;\">First Round :&nbsp; Asked a basic puzzles and Quant questions. Basic HR like why you want to work for AmEx, trying to convince him that I am not going for higher studies at all etc.<\/span><\/li><li><span style=\"background-color:transparent;color:#000000;\">Second Round :&nbsp; A case study involving just finding the factors. After that a few puzzles and quant question. Discussion about the profile (Analyst) and again some HR questions.<\/span><\/li><\/ol><p><span style=\"background-color:transparent;color:#000000;\"><strong><u>Placement Fundae: Some Advise<\/u><\/strong><\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">These are all based on personal experiences:<\/span><\/p><ol><li><span style=\"background-color:transparent;color:#000000;\">Sometimes during the placement season, it becomes a bit hectic in order to manage both placement prep and academic load as your course instructors would not be too generous to factor-in this criteria before giving any timeline for quiz or anything. So, I would advise you to choose your 7th semester courses wisely with a bit of a lesser academic load.&nbsp;<\/span><\/li><li><span style=\"background-color:transparent;color:#000000;\">When the tests begin, they might continue till 2:30 AM and some days you may have 4-5 tests consecutively but be calm and maintain some healthy sleep and diet cycle during this time.<\/span><\/li><li><span style=\"background-color:transparent;color:#000000;\">Another source of mocking during this period are your friends with PPO, or those who have converted to 5 yrs, as they will keep enjoying, but you will have to bear it all. You might have to miss Antaragni nights (as there are tests on those nights as well), but at the end of it all, finally everything falls into place.&nbsp;<\/span><\/li><li><span style=\"background-color:transparent;color:#000000;\">Although I started my preparation a bit earlier than usually people do, I will suggest don’t wait till the PPO’s are announced and start preparing as soon as you get free from your internships. This will surely help you in the long-run, even if you made it to the PPO.<\/span><\/li><li><span style=\"background-color:transparent;color:#000000;\">A frequently missed point about placement drive is during internship once a student secures an intern he\/she leaves the portal, so competition is over. But during placements he\/she will continue giving tests till the D-day which increases the competition a bit. Although at the end all this is resolved and your IITK life smoothly walks into the serene days of the final semester.<\/span><\/li><\/ol><p><span style=\"background-color:transparent;color:#000000;\">Don’t worry too much about the academic semester, because as virus (in 3 idiots) said, “This is your last lap, my friends Put the medal on the pedal. Accelerator dabao. Go out there and make history!”. If you have sailed through 6 semesters, you will surely pass this one as well, it is likely your SPI might be a bit lower than usual but how does it matter as SPO resumes only have details up to 6th semester (until unless you update it). The internship season was just a trailer, the full picture is revealed in the placement drive. <\/span><span style=\"background-color:#ffffff;color:#000000;\">In the end thanks to all my seniors, juniors and mates for making me sail through this.<\/span><\/p><p><span style=\"background-color:#ffffff;color:#000000;\">In case of any further doubt, feel free to ping me<\/span><\/p>","author":"Prajual Maheshwari"}