{"title":"Placement Fundae - Ayushree Gupta","date":"24 Septemeber 2020","intro":"Hi! I am Ayushree Gupta. I have graduated with a double major in Economics and Mathematics and expect to join BCG as an associate later this year. This is my placement preparation journey!","content":"<p><span style=\"background-color:transparent;color:#000000;\"><strong>Internship&nbsp;<\/strong><\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">From my first week on campus, I have learnt and participated in many different activities - I was majorly a part of the Aquatics Team and a regular volunteer at Prayas but I had also learnt art, danced in galaxy, took up research projects in my first two years. I was always trying to figure out what I wanted to do after college but I had no idea when the internship season began in my third year.&nbsp; I finally interned at Barclays as an analyst in the summers. The interview for my internship was conducted through the SPO and mainly consisted of puzzles and questions on regression and statistics. I had prepared for internships in August and had been finally placed at the end of the fifth semester. I was a part of the fraud analytics team and had worked on a model to predict which credit card transactions are fraudulent. The project itself was quite interesting but my experience there was pretty boring and I wasn’t sure that I wanted to pursue analytics after graduation. I then worked on a research paper in my 4<sup>th<\/sup> year to see if I liked research in Economics.<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\"><strong>Placement Preparation<\/strong><\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">As my 4<sup>th<\/sup> year ended and most of my friends were moving on to the next chapter in their lives, I was staying back in campus to complete my second major but I had still not decided what I wanted to do. I am very bad at making decisions; I can’t even choose what to eat for lunch when out with my friends, how was I supposed to make a decision on what to do next. I had been offered admission in the MSQE program at ISI in June end. If I wanted to do a PhD eventually, ISI was a great option. However, I wasn’t sure if after investing 2 years in a Masters I would actually study anymore. Also, I realized I had already done most of the courses they were offering after looking at their course structure, so I decided to continue my major and appear for placements this year. Around this time I had started preparing by watching Victor Cheng videos for consulting, going through books and websites for Quant and Statistics and coding on InterviewBit. It was obvious I was trying to do everything and this wasn’t going to help me much. I was also feeling lonely when my friends left campus after convocation, thus making very little progress with placement preparation, ending up watching TV shows and reading books all the time.&nbsp;<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">Around the end of July, McKinsey and BCG asked for resumes. This is when I actually started putting in more effort. I began by updating my resume. I got feedback from two people (I know we’re supposed to ask more people but I was satisfied with it and didn’t want any more changes.) I also started practicing cases with friends who had graduated. I found this time particularly useful because there was a lot I learnt from the experiences of these people. I still hadn’t formed a case group, so I wasn’t practicing cases daily and was often reminded of the fact that I was significantly behind on case preparation. I don’t think I ever decided that I really wanted to do consulting; it was just that I stopped preparing for Coding or Analytics when I was shortlisted in the beginning of August. This is when I rigorously started case preparation; every day I met with 3 different groups to practice for the interview and pondered over mistakes I was making. I also continued practicing on weekends with friends who had given interviews last year. McKinsey had also assigned buddies but they were busy and in the US so I was unable to do any cases with them. Though, I did do a few cases with other people from McKinsey.<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">I had done little other than preparing for interviews in August. I only had four courses in the semester but went to only one class which had compulsory attendance. I was supposed to be a part of the Aquatics meet team in October but wasn’t going to practice in the evening because I was practicing cases most of the time. I would try to go to practice in the morning and Prayas in the evening but would end up missing a lot. I kept hoping if I got into McKinsey I would be free in September to go to practice and Prayas whenever I want.&nbsp;<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">The interview was scheduled in the end of August; the exact date was announced 3 days before. Till then I had done many cases including those from the IITB and IIMA casebook, written points for HR questions and was confident that I could get through. However, I couldn’t even clear the first round of interviews and was disheartened at the end of it. Looking back, both interviews in the first round had a mix of HR and case questions. Both of them started in depth with the HR answers that I couldn’t answer very well, which eventually led me to not approach the case question properly.<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">I had two more interviews to look forward to but academics and other involvements including Aquatics, Prayas and placement presentations were starting to load up as I entered September. I had been skipping classes so I had to catch up with the syllabus for quizzes and the midsemester examinations. I shifted focus to academics, confused on whether to give up on consulting and prepare for other profiles instead. I started revising statistics and coding occasionally but was still not putting in much time and effort for other profiles (which was probably a mistake at that time since placement tests were right around the corner). I continued practicing with my BCG and Bain buddies and friends over the weekend and looked over cases I had done before over the week. At this point, I had also started recording and listening to the cases I was doing to properly analyze each case. The BCG interview was scheduled at the end of September, a week after the midsemester exams and Bain had interviews a week after that. And in between both the interviews was the Aquatics meet which I finally decided not to go to.<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\"><strong>Interview Day&nbsp;<\/strong><\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">The day before the BCG interview was spent reading while travelling from campus to Gurgaon. Don't prepare much just before the interview, it just adds to the tension and anxiety, instead follow your normal routine and try to get a good night's sleep. I had three interviews in two rounds. In my first interview, I panicked and told the interviewer I was nervous, took a moment and continued the interview. I felt that I hadn’t done well and there was no way I was being called for the next round. I had taken a book with me and read it while I was waiting to be called for my interview with other candidates. While waiting for over 3 hours to be called for the next interview I didn’t talk to anyone and kept seeing others going for their third and even fourth interviews. I thought they were never going to call me but when I was finally called for the interview I was surprisingly told that I had actually done very well in the first one. This boosted my confidence and I was able to do really well in the second interview and the next round with the partner. My first two rounds included both a case and HR interview while the last round had only a case interview. I couldn’t believe it when I was finally offered a job and was really happy and relieved. Over the next few months I hardly studied at all and invested all my time in Prayas.<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\"><strong>Concluding Remarks<\/strong><\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">There are two things I learnt from my placement experience. The first is that preparation strategies vary, find the one that suits you best even if it is completely different from what anyone tells you. The second is to keep your friends close. The placement preparation period can be a very confusing and stressful time when you are balancing a lot of important things, making important decisions and talking to friends helps a lot.&nbsp;<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">Lastly, I am sure most of you are equally confused on what to do ahead and will probably give a shot at everything. It would be great if you could set aside some time to choose what you would really like to do but even if you can’t you’ll probably find the right way eventually. Just keep exploring, keep experimenting and keep learning!<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">Best of luck and do reach out to me for help!<\/span><\/p>","author":"Ayushree Gupta"}