{"title":"Placement Fundae - Simran Sundrani","date":"October 23, Friday","intro":"I am Simran Sundrani, graduated with a bachelor's degree in Materials Science & Engineering. I will be joining PwC DIAC as a  Business Analyst","content":"<p><span style=\"background-color:transparent;color:#000000;\">It was 1st of December, 2019, 4:30 in the morning ( Day 1 of Placements ). I was getting ready for the interview, and forgot to iron my blazer at night. I rushed to my friend's room and then happened to almost burn my blazer. At that moment I was<i> <\/i>filled with anxiety, my mind had stopped working for I couldn’t think clearly at all and, in this haze of emotions, I was getting continuous calls from the SPO volunteers. That was an epic day.<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">To begin with, I had to make sure that I explored my department first as I enjoyed departmental courses. I did a project during my second year summers. It included both experimental and simulation work. I didn’t really enjoy the experience. I did the required work anyway though it was not something that really captivated my interest or triggered me to work passionately. So, by the end of summer, I was sure that I don’t wish to proceed in this field, maybe I was too quick to judge but I don’t regret the decision. After figuring out that pursuing future studies in the department is not an option, I decided to sit for the internship process. Those were some of the most challenging days of my stay at IITK. I was shortlisted almost everywhere I applied, gave multiple interviews, and got rejected everywhere. To be honest, these rejections were hard to swallow. With each passing interview, my confidence dropped and a point came when I would blindly apply anywhere ( please do not do this) because I was so desperate for getting an internship and be done with the process. Finally, I secured an internship but because of my lack of preparation that was not as par my expectations. But, I believe that whatever happens, happens for a reason. This entire process taught me two life lessons, first, when 10 doors are slammed in your face, how to go to door number 11 with the same level of enthusiasm and a smile on your face and second, always prepare well for your interviews. It doesn’t really matter how good your resume is if you can’t explain that to an interviewer then it’s all in vain. Resume speaks about what you have done during your stay, it will definitely help you in getting shortlisted but during the interview, you are the one who is being evaluated not that sheet of paper<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">My negligence in applying anywhere without having an understanding of job specifics, during internship drive, got me into trouble. So, a piece of advice: do not just vaguely go through the job descriptions, have a thorough understanding of where your responsibilities lie. Attend PPTs, clear any doubts regarding job expectations\/roles during the PPTs, and most importantly talk to the alums working there about how their experience has been, before applying to any company.&nbsp;<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">After the internship experience, I was pretty sure that corporate would be a good fit for me, so I decided to sit for the placements. Having gone through the details of different job roles, I decided consulting suits me best. With a mindset for pursuing a consulting job, I applied for MBBs and was not shortlisted even for a single one. <\/span><span style=\"background-color:#ffffff;color:#000000;\">Having faced multiple rejections previously, this time it was a bit easy to not get lost in the maze of negative emotions. I took some time to figure out what should be my next plan of action.<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">I had a few analyst &amp; tech roles in mind and so I started preparing for those. For most of these companies, after resume shortlisting, the first round was either an aptitude or a coding test or a combination of both. For the aptitude part, I used to practice from Pariksha.com and Prepleaf. Though it was a bit late to start preparing for coding profiles, as most people start coding preparation from summers, but better late than never. As I had done some courses previously, conceptually I was not a noob. So I decided to start practicing coding mainly from InterviewBit.<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">As for the interviews, I practised puzzles mainly from&nbsp; GeeksforGeeks, Brainsteller &amp; InterviewBit. I also practised some guesstimates as they are frequently asked in interviews. For probability, I solved the book called “Fifty Challenging Problems in Probability” by Frederick Mosteller. This book will help you to brush through the concepts of probability.&nbsp;<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">It was mid-September, during those tightly packed days, the PwC DIAC selection process began. The first round was resume shortlisting and around 40 students were shortlisted. After getting shortlisted, in the first week of October each student was allotted a buddy. Buddy is an alum currently working in PwC who helps you navigate through the interview process. According to their description, the buddy process was not evaluative and based on my personal experience, as well, the process was not evaluative. I was in regular contact with my buddy, but solved only 2-3 cases with him and they went terribly bad. He guided me and made me understand the importance of asking the right questions.<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">There is a conventional path which most of the students follow for preparing cases. First is watching Victor Cheng’s Videos, which I did during my 3rd year summers. It gives you an understanding of the basics of case interview, how to open and close a business case, what are the different frameworks &amp; how to practice. Once you are done with this, it’s time to level up by solving cases from IITB &amp; IITM casebooks and then if time permits you can have a look at IIMA &amp; HBS casebooks.<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">But I didn’t follow the conventional path. I just did 10-15 cases while most of the other students shortlisted did around 40-50 cases. I practiced 3-4 cases from&nbsp; ‘Case Interviews Cracked’ by IITB and majority from “IIMA Casebook”, 2016 edition. I believed that more than focusing on the number of cases solved, it was important to focus on evaluating each case that I did and learning from my mistakes. I made sure that each case I solve proves its worth. I tried to think in a structured fashion rather than following a typical framework.<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">There were no other rounds before the interview.<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">Now coming back to the story about Day 1 of placements, I somehow managed to get ready &amp; reached Hall-13 for the interviews by 5.30 AM. I had three interviews scheduled for Day-1, Slot-1. For PwC I had two rounds. In the first round, I was given an unconventional case. Then I was posed with a couple of HR questions. One should spend an ample amount of time preparing for the HR questions as well. The interview went for about 30-40mins.<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">First round was qualifying, around 15-20 students were selected for the second round.&nbsp;&nbsp;<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">In the second round, I was given one case on market entry which finally took the profitability structure and the second was aimed at testing how diversely I can think on a particular topic.<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">In this round, I was asked some targeted HR questions like Why PwC, Why should we hire you etc. Basically you should know how to pitch yourself appropriately. The second round went for about 45-50mins.<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">I only had two rounds, while eight candidates had three rounds. Then I went back to my room at 12:45 PM to rest. As I had a few more interviews scheduled for Slot-2, I had to be prepared for that. I thought that the second round was qualifying as well. But that was not the case, as around 1.30 PM I got a call that I was selected. The day began with chaos and ended up being one of the most memorable days of my life.&nbsp;&nbsp;<\/span><\/p><p><span style=\"background-color:transparent;color:#050505;\">Apart from preparation, what is important?<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">Optimism is the key. Placement season can be very tough and dull if you don’t deal with it with the right attitude. It’s natural to feel demotivated at times when you see people getting shortlisted while you don’t or there could be other reasons. What I believe is instead of looking at what you couldn't achieve, look at what other opportunities you are left with.&nbsp;&nbsp;<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">Surround yourself with positive energy, not just during the placements but in general in your life. Be around people, who are there to lift you &amp; who genuinely want to see you happy. Cut off yourself from negative energies. I am blessed to have an amazing bunch of people in my life.<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">Having Confidence in yourself is a must. Believe in Yourself. If you don’t believe in yourself then how will you make an interviewer believe that you are worth being a part of their organisation.&nbsp;<\/span><\/p><p><span style=\"background-color:transparent;color:#000000;\">One final piece of advice, don’t just rely on SPO for getting placed. Yes, it is difficult to get an offer off campus but it's not impossible and it’s good to have a backup plan. Never lose hope. You have survived these four\/five years, I am certain that you can go through this phase as well. Don’t hesitate to contact the IITK alumni community, as they are always happy to help. Good luck!!<\/span><\/p>","author":"Simran Sundrani"}